app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blogs_params)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "today"], ["content", "3rd June"], ["user_id", 2], ["created_at", "2017-06-03 10:06:44.806142"], ["updated_at", "2017-06-03 10:06:44.806142"]]