app/controllers/comments_controller.rb

INSERT INTO "comments" ("blog_id", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["blog_id", 2], ["content", "comment"], ["user_id", 2], ["created_at", "2017-07-08 05:00:48.220617"], ["updated_at", "2017-07-08 05:00:48.220617"]]
INSERT INTO "notifications" ("user_id", "comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["comment_id", 19], ["created_at", "2017-07-22 03:34:16.412896"], ["updated_at", "2017-07-22 03:34:16.412896"]]
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = $1 AND "notifications"."read" = $2  [["user_id", 2], ["read", "f"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @blog = @comment.blog
    @notification = @comment.notifications.build(user_id: @blog.user.id)

    respond_to do |format|
      if @comment.save
        format.html{ redirect_to blog_path(@blog),notice: 'コメントを投稿しました。'}
        format.js {render :index}
        unless @comment.blog.user_id == current_user.id
        Pusher.trigger("user_#{@comment.blog.user_id}_channel", 'comment_created', {
          message: 'あなたの作成したブログにコメントが付きました'
        })
        end
        Pusher.trigger("user_#{@comment.blog.user_id}_channel", 'notification_created',{
        unread_counts: Notification.where(user_id: @comment.blog.user.id,read:false).count
        })