app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contacts_params)
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "misa"], ["email", "misatatesawa@gmail.com"], ["content", "test"], ["created_at", "2017-06-03 10:47:16.253806"], ["updated_at", "2017-06-03 10:47:16.253806"]]