app/controllers/conversations_controller.rb

  def index
    @users = User.all
    @conversations = Conversation.all
---
SELECT "conversations".* FROM "conversations"

  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id],params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)
---
SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '2' AND conversations.recipient_id = '3') OR (conversations.sender_id = '3' AND conversations.recipient_id = '2'))  ORDER BY "conversations"."id" ASC LIMIT 1
SELECT  1 AS one FROM "conversations" WHERE ("conversations"."sender_id" = 2 AND "conversations"."recipient_id" = 3) LIMIT 1
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 2], ["recipient_id", 3], ["created_at", "2017-07-18 01:55:22.836348"], ["updated_at", "2017-07-18 01:55:22.836348"]]