app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def create
    @user = User.find(params[:relationship][:followed_id])