app/controllers/users_controller.rb

  def show
    @users = User.all
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]